Repository: max-dau/Translate
Catalog: Localization/*/dig-deeper.po
Languages: de_de

source: Yes. Work Units are labeled with four distinct numbers in the format: Project (Run, Clone, Generation). We just described the first three; Project is the protein under study, a Run is a simulation started from a particular conformation, and Runs contain many Clones which have different initial velocities. Although Folding@home processes many different Projects, Runs, and Clones all at the same time, Clones themselves are serial in nature. They have to be simulated from start to finish, but it would be impractical for one computer to complete one by itself. Instead, your computer is given a piece of a Clone. We identify the piece using the Generation (Gen) number. One computer will start out with Generation 0, and when it finishes another computer is given Generation 1, etc. We cannot start Gen 1 until Gen 0 finishes, and there may be hundreds of Gens. This is why the Work Units have deadlines, and why speed is so important to us.
de_de: Ja. Arbeitseinheiten (Work Units) sind mit vier unterschiedlichen Zahlen im Format beschriftet: Projekt (Lauf, Klon, Generation). Wir haben gerade die ersten drei beschrieben; das Projekt ist das untersuchte Protein, ein Lauf ist eine Simulation, die auf Basis einer bestimmten Konformation gestartet wurde, und Läufe enthalten viele Klone, die unterschiedliche Anfangsgeschwindigkeiten aufweisen. Obwohl Folding@home viele verschiedene Projekte, Läufe und Klone gleichzeitig verarbeitet, sind Klone selbst serieller Natur. Sie müssen von Anfang bis Ende simuliert werden, aber es wäre unmöglich, einen einzelnen Computer einen Klon alleine abschließen zu lassen. Stattdessen erhält Ihr Computer einen Teil eines Klons. Wir identifizieren das Teil mit der Generation (Gen) Nummer. Ein Computer startet mit Generation 0, und wenn er fertig ist, erhält ein anderer Computer Generation 1, usw. Wir können Gen 1 erst starten, wenn Gen 0 beendet ist, und es können Hunderte von Gens sein. Deshalb haben die Arbeitseinheiten Fristen, und deshalb ist Geschwindigkeit für uns so wichtig.

source: Why is this approach particularly useful?
de_de: Warum ist dieser Ansatz besonders nützlich?

source: This approach can be powerful because not only is it very amendable to distributed computing, but the available computational resources can be used more efficiently. A protein spends most of its folding time “stuck” in an energetically-favorable position, with transitions – the processes largely of interest – taking place only rarely. Likewise, any straightforward simulation of protein folding will also waste valuable time generating data with little information content. However, using the adaptive sampling concept, the model can identify when the simulation is stuck, and then reinitialize new simulations starting from potentially more fruitful areas, avoiding the wasteful process of re-exploring areas that are already well understood.
de_de: Dieser Ansatz kann stark sein, da er nicht nur sehr verbesserungsfähig für verteiltes Computing ist, sondern auch die verfügbaren Rechenressourcen effizienter genutzt werden können. Den größten Teil seiner Faltzeit steckt ein Protein in einer energetisch günstigen Position fest, wobei Übergänge – die Prozesse, die von hauptsächlichem Interesse sind – nur selten stattfinden. Ebenso verschwendet jede einfache Simulation der Proteinfaltung wertvolle Zeit bei der Generierung von Daten mit geringem Informationsgehalt. Mithilfe des Konzepts des adaptiven Samplings kann das Modell jedoch erkennen, wann die Simulation feststeckt und dann neue Simulationen aus möglicherweise erfolgreicheren Bereichen neu initialisieren, um den verschwenderischen Prozess der Neuerkundung von Bereichen zu vermeiden, die bereits gut verstanden sind.

source: In a recent paper, we compared MSMs to more traditional simulation methods. We compared some very long folding trajectories from the Anton supercomputer to an MSM built from the same folding data. Although our MSM “chops up” the simulation into a bunch of short trajectories, it was able to reproduce their simulations very well. Moreover, we also found that the MSM approach revealed new insights into the folding process (a new folding pathway) that was missing in ANTON’s more traditional approach.
de_de: In einem kürzlich veröffentlichten Papier haben wir MKs mit traditionelleren Simulationsmethoden verglichen. Wir verglichen einige sehr lange Bewegungsrichtungen vom ANTON Supercomputer mit einer MK, die aus den gleichen Faltungsdaten erstellt wurde. Obwohl unsere MK die Simulation in eine Reihe von kurzen Bahnen „abschneidet“, konnte es ihre Simulationen sehr gut reproduzieren. Darüber hinaus fanden wir auch heraus, dass der MK-Ansatz neue Einblicke in den Faltprozess (einen neuen Faltweg) offenbarte, der im traditionelleren Ansatz von ANTON fehlte.

source: What are some of the applications for these techniques?
de_de: Was sind einige der Anwendungen für diese Techniken?

source: MSMs and adaptive sampling have been used to study protein folding (1-8), functional dynamics (8-11), ligand-binding (11-14), and protein-protein interactions (15).
de_de: MSMs und adaptives Sampling wurden verwendet, um Proteinfaltung (1-8), funktionelle Dynamik (8-11), Ligandenbindung (11-14) und Wechselwirkungen zwischen Proteinen (15) zu untersuchen.

source: Who answered these questions?
de_de: Wer hat diese Fragen beantwortet?

source: These questions were answered primarily by TJ Lane, Gregory Bowman, Robert McGibbon, Christian Schwantes, Vijay Pande, and Bruce Borden.
de_de: Diese Fragen wurden hauptsächlich von TJ Lane, Gregory Bowman, Robert McGibbon, Christian Schwantes, Vijay Pande und Bruce Borden beantwortet.
