Repository: max-dau/Translate
Catalog: Localization/*/together-we-are-powerful.po
Languages: de_de

source: Together We Are Powerful - Folding@home
de_de: Gemeinsam Sind Wir Stark - Folding@home

source: [Take me home](https://foldingathome.org/home)
de_de: [Zur Startseite](https://foldingathome.org/home)

source: TOGETHER, WE ARE POWERFUL
de_de: GEMEINSAM SIND WIR STARK

source: Together, we have created the most powerful supercomputer on the planet, and are using it to help understand SARS-CoV-2/COVID-19 and develop new therapies. We need your help pushing toward a potent, patent-free drug.
de_de: Gemeinsam haben wir den leistungsstärksten Supercomputer der Welt geschaffen und nutzen ihn, um SARS-CoV-2/COVID-19 zu verstehen und neue Therapien zu entwickeln. Wir brauchen Ihre Hilfe, um auf ein wirksames, patentfreies Medikament hinzuarbeiten.

source: Use your PC to help fight COVID-19.
de_de: Nutzen Sie Ihren PC, um im Kampf gegen COVID-19 zu helfen.

source: [DOWNLOAD FOLDINGATHOME](#downloads)
de_de: [FOLDINGATHOME HERUNTERLADEN](#downloads)

source: [Available for Windows, Mac, Linux]
de_de: [Verfügbar für Windows, Mac, Linux]

source: Progress on the current Sprint 1 to evaluate a batch of potential drugs Started Sun Jul 26 06:31:13 UTC 2020
de_de: Fortschritt des aktuellen Sprints 1 zur Bewertung einer Serie potenzieller Medikamente gestartet am Sonntag, 26. Juli 2020 06:31:13 UTC

source: Campaign Trailer
de_de: Kampagnen-Trailer

source: Play
de_de: Abspielen

source: Learn about our work on SARS-CoV-2 and COVID-19.
de_de: Erfahren Sie mehr über unsere Arbeit an SARS-CoV-2 und COVID-19.

source: We are focusing the Foldingathome compute power on SARS-CoV-2, the virus that causes COVID-19, and the human proteins the virus interacts with.
de_de: Wir konzentrieren die Rechenleistung von Foldingathome auf SARS-CoV-2 (das Virus, welches COVID-19 verursacht) sowie die menschlichen Proteine, mit denen das Virus interagiert.

source: First, we uncovered novel protein structures that were previously inaccessible to the research community.
de_de: Zuerst entdeckten wir neuartige Proteinstrukturen, die der Forschungswelt zuvor nicht zugänglich waren.

source: With your help, we are now screening for potential drugs to target these structures as a part of the COVID Moonshot Collaboration.
de_de: Mit Ihrer Hilfe prüfen wir nun im Rahmen der COVID-Moonshot-Zusammenarbeit auf mögliche Medikamente, welche diese Strukturen ins Visier zu nehmen.

source: See real-time progress toward new drugs
de_de: Beobachten Sie die Entwicklung neuer Medikamente in Echtzeit

source: Foldingathome Ambassadors
de_de: Botschafter von Foldingathome

source: CEO, Microsoft
de_de: Geschäftsführer, Microsoft

source: President & CEO, AMD
de_de: Vorsitzende & Geschäftsführerin, AMD

source: CEO, Nvidia
de_de: Geschäftsführer, Nvidia

source: Director of Foldingathome & Associate Professor, Washington University School of Medicine in St Louis
de_de: Leiter von Foldingathome & Dozent der Washington University School of Medicine in St Louis

source: CEO, Pure Storage
de_de: Geschäftsführer, Pure Storage

source: Medical student, Lund University
de_de: Medizinstudentin, Universität Lund

source: Director of Innovation and Technological Transformation at LaLiga
de_de: Direktorin für Innovation und Technologiewandel, LaLiga

source: PhD Student, Bowman lab, Washington University School of Medicine in St Louis
de_de: Doktorand, Bowman Labor, Washington University School of Medicine in St. Louis

source: CEO, VMware
de_de: Geschäftsführer, VMware

source: Founder, PCMR / Communication Advisor, Foldingathome
de_de: Gründer, PCMR / Kommunikationsberater, Foldingathome

source: General Partner, Andreessen Horowitz / Founder, Foldingathome
de_de: Allgemeiner Partner, Andreessen Horowitz / Gründer, Foldingathome

source: Head of Collaboration and Communication, Foldingathome
de_de: Leiter für Zusammenarbeit und Kommunikation, Foldingathome

source: Phd Student Xuhui lab, The Hong Kong University of Science and Technology
de_de: Doktorand im Xuhui Labor, Universität für Wissenschaft und Technologie Hongkong

source: Info Security Engineer
de_de: Ingenieurin der Informationssicherheit

source: Compilation Video
de_de: Video-Zusammenschnitt

source: Courtesy – Washington University in Saint Louis
de_de: Mit freundlicher Genehmigung der Washington University in Saint Louis

source: SHARE YOUR STORY
de_de: TEILEN SIE IHRE GESCHICHTE

source: Help us spread the word about Foldingathome and why you have joined. Create your video and share it on social media.
de_de: Helfen Sie uns, auf Foldingathome aufmerksam zu machen und erzählen Sie, warum Sie mitmachen. Erstellen Sie ein Video und teilen Sie es über sozialen Medien.

source: Step 1) Record yourself to make a video like those above.
de_de: Schritt 1) Nehmen Sie, analog zu den oberen, ein Video von sich selbst auf.

source: Step 2) Share it on social media with hashtag #foldingathome and follow @foldingathome on Facebook and Twitter.
de_de: Schritt 2) Teilen Sie es unter dem Hashtag #foldingathome in sozialen Medien und folgen Sie @foldingathome auf Facebook und Twitter.

source: Thank you!
de_de: Vielen Dank!

source: [Learn more about Folding@home](https://foldingathome.org/home)
de_de: [Erfahren Sie mehr über Folding@home](https://foldingathome.org/home)

source: Choose your platform
de_de: Wählen Sie Ihre Plattform

source: Contributors
de_de: Unterstützer
